---
kind: method
id: M:Autodesk.Revit.DB.ExportDWGSettings.GetDWGExportOptions
source: html/d5372a5c-b19a-03a8-4a2b-5f3617acec61.htm
---
# Autodesk.Revit.DB.ExportDWGSettings.GetDWGExportOptions Method

Gets the options stored in the these settings.

## Syntax (C#)
```csharp
public DWGExportOptions GetDWGExportOptions()
```

## Returns
The options.